{
  "meta": {
    "project_name": "BE Schema Engine",
    "alias": "BE SEO Engine",
    "author": "William Evans, PhD",
    "description": "Central, conservative schema + social meta for WordPress (Elementor-first), with strong safety, Elementor integration, debug tooling, and a predictable architecture.",
    "version": "2.1.25",
    "repo_root": "beseo/"
  },
  "workflows": {
    "after_push": {
      "description": "After the user confirms a push, review the changelog entry and staged files to verify what moved."
    },
    "debug": {
      "schema_debug_requires_wp_debug": true,
      "social_debug_requires_wp_debug": true,
      "description": "Both schema and social debug logging require WP_DEBUG plus the plugin-level debug or BE_SCHEMA_DEBUG flag.",
      "collector_notes": "be_schema_debug_collect now stores emitted graphs and logs BE_SCHEMA_DEBUG_GRAPH payloads when debug is enabled."
    },
    "versioning": {
      "description": "Project is called BESEO. When adding new features, increment the minor version. For other source changes, increment the patch version."
    },
    "pre_commit": {
      "hook_path": ".githooks/pre-commit",
      "enable_command": "git config core.hooksPath .githooks",
      "behavior": "On commit, auto-bumps the version (BESEO_BUMP=minor|patch; default patch), updates beseo.php and beseo-devnotes.json, and prepends a changelog entry listing staged files.",
      "changelog": "CHANGELOG.md is auto-maintained by the pre-commit hook.",
      "description_logic": "Changelog summary line is prefixed with 'Summary:' and capitalizes the first letter of the summary text (BESEO_CHANGELOG_DESC overrides). Sections (Added/Changed/Fixed/Removed/Security/Upgrade Notes) render only when populated, and the staged file list appears under Files only. Header uses an HTML <hr /> divider and the Overview changelog renderer converts --- or <hr> lines into a styled horizontal rule.",
      "runtime": "Requires python3 (preferred) or python in PATH; hook exits if neither is available."
    },
    "prepare_commit_msg": {
      "hook_path": ".githooks/prepare-commit-msg",
      "behavior": "If the commit message is empty, auto-fills a human-centered default. Override with BESEO_COMMIT_MSG env var or by typing your own message.",
      "default_message": "BESEO: update"
    }
  },
  "files": [
    {
      "path": "beseo.php",
      "group": "bootstrap",
      "role": "Main plugin bootstrap; defines constants, loads includes, registers core hooks."
    },
    {
      "path": "includes/admin/admin-menu.php",
      "group": "admin",
      "role": "Registers top-level BE SEO admin menu and submenus (Overview default, Schema, Social Media, Tools)."
    },
    {
      "path": "assets/images/admin/be_seo-landing_image.webp",
      "group": "assets",
      "role": "Hero background image for the Overview admin page."
    },
    {
      "path": "CHANGELOG.md",
      "group": "assets",
      "role": "Packaged changelog copy used for the Overview hero preview."
    },
    {
      "path": "includes/admin/page-overview.php",
      "group": "admin",
      "role": "Overview landing page with hero background image (cover), row-based hero content (title, version, GitHub and Bill's site links) plus inline rendered changelog preview."
    },
    {
      "path": "includes/admin/page-dashboard.php",
      "group": "admin",
      "role": "Dashboard/overview page for the BE SEO plugin (if used)."
    },
    {
      "path": "includes/admin/page-schema.php",
      "group": "admin",
      "role": "Schema submenu UI: Settings + Website tabs; Website tab has vertical Global/Person/Organisation/Publisher sections."
    },
    {
      "path": "includes/admin/page-social-media.php",
      "group": "admin",
      "role": "Social Media submenu UI: Settings/Facebook/Twitter tabs and associated options."
    },
    {
      "path": "includes/admin/page-tools.php",
      "group": "admin",
      "role": "Tools submenu UI (future home for validators, snapshots, etc.)."
    },
    {
      "path": "includes/engine/core-breadcrumbs.php",
      "group": "engine",
      "role": "Emits BreadcrumbList schema for non-front pages; always two levels: root + current."
    },
    {
      "path": "includes/engine/core-debug.php",
      "group": "engine",
      "role": "Schema debug collector and shutdown logger; writes BE_SCHEMA_DEBUG_GRAPH payloads to error_log when enabled."
    },
    {
      "path": "includes/engine/core-elementor.php",
      "group": "engine",
      "role": "Elementor integration: page-level schema controls, widget-level enable switch, and safe, limited widget schema output."
    },
    {
      "path": "includes/engine/core-helpers.php",
      "group": "engine",
      "role": "Shared helper functions for text normalization, image normalization, per-page disable checks, and post-type eligibility."
    },
    {
      "path": "includes/engine/core-posts.php",
      "group": "engine",
      "role": "BlogPosting schema for eligible single posts, including dates, description, mainEntityOfPage, author, publisher, and image."
    },
    {
      "path": "includes/engine/core-site-entities.php",
      "group": "engine",
      "role": "Builds site-level entities: Person, Organisation, WebSite, Publisher, and shared logo/person image nodes."
    },
    {
      "path": "includes/engine/core-social.php",
      "group": "engine",
      "role": "Outputs OpenGraph and Twitter Card meta tags based on Social Media settings and page context."
    },
    {
      "path": "includes/engine/core-special-pages.php",
      "group": "engine",
      "role": "Page-level schema for homepage and special pages (Contact, About, Privacy, Accessibility) with Elementor page-type integration."
    }
  ],
  "schema_design": {
    "site_entities": {
      "person": {
        "enabled_via_admin": true,
        "default_name_source": "site_name",
        "image_sources": [
          "person_profile_image",
          "logo"
        ],
        "honorific_fields": [
          "honorificPrefix",
          "honorificSuffix"
        ],
        "sameAs_source": "person_textarea_only"
      },
      "organisation": {
        "enabled_via_admin": true,
        "logo_source": "global_logo",
        "sameAs_source": "be_schema_sameas_urls_filter",
        "fields": [
          "name",
          "legalName",
          "url"
        ]
      },
      "website": {
        "always_present": true,
        "about_preference_order": [
          "organisation",
          "person"
        ],
        "logo_source": "global_logo",
        "publisher_resolution_order": [
          "custom_publisher_org",
          "organisation",
          "person"
        ]
      },
      "publisher": {
        "optional": true,
        "can_be_custom_org": true,
        "custom_logo_source": "publisher_logo",
        "fallback_to_site_entities": true
      }
    },
    "page_schema": {
      "homepage": {
        "graph_nodes": [
          "Person",
          "Organisation",
          "WebSite",
          "WebPage"
        ],
        "webpage_links": {
          "isPartOf": "#website",
          "about": [
            "#organisation",
            "#person"
          ],
          "primaryImageOfPage": [
            "featured_image",
            "global_logo"
          ]
        }
      },
      "special_pages": {
        "types": {
          "contact": "ContactPage",
          "about": "AboutPage",
          "privacy-policy": "PrivacyPolicy",
          "accessibility-statement": "WebPage"
        },
        "description_strategy": "elementor_override_or_default_string",
        "respects": [
          "global_disable",
          "per_page_disable",
          "elementor_page_enable"
        ]
      }
    },
    "blogposting": {
      "eligibility": {
        "is_singular_post": true,
        "post_type_filter": "be_schema_is_singular_eligible",
        "per_page_not_disabled": true
      },
      "fields": {
        "id_suffix": "#article",
        "mainEntityOfPage": "WebPage node with @id = post permalink",
        "description_sources": [
          "excerpt",
          "normalized_content_snippet"
        ],
        "dates": [
          "datePublished",
          "dateModified"
        ],
        "author": "Person#person",
        "publisher": "resolved_publisher_entity",
        "image_sources": [
          "featured_image",
          "be_schema_get_default_image_url"
        ]
      }
    },
    "breadcrumbs": {
      "always_two_steps": true,
      "steps": [
        "site_root",
        "current_page_or_archive"
      ],
      "skips": [
        "front_page",
        "schema_disabled_pages"
      ],
      "url_cleaning": [
        "utm_*",
        "gclid",
        "fbclid"
      ]
    },
    "elementor": {
      "page_level": {
        "enable_control": "be_schema_enable_page",
        "enable_yes_value": "yes",
        "default_disabled_if_missing": true,
        "page_type_control": "be_schema_page_type"
      },
      "widget_level": {
        "enable_control": "be_schema_enable_widget",
        "only_yes_emits_schema": true,
        "schema_only_for_curated_widgets": true
      }
    }
  },
  "social_design": {
    "purpose": "Social Media module is only for OpenGraph and Twitter Cards; it does not emit JSON-LD or canonical tags.",
    "data_flow": {
      "admin_settings_option": "be_schema_social_settings",
      "engine_file": "includes/engine/core-social.php"
    },
    "url_behavior": {
      "primary_source": "wp_get_canonical_url_or_permalink",
      "cleaning": [
        "utm_*",
        "gclid",
        "fbclid",
        "fragments"
      ]
    },
    "title_behavior": {
      "source": "wp_get_document_title"
    },
    "description_behavior": {
      "singular_sources": [
        "excerpt",
        "post_content"
      ],
      "non_singular_source": "site_tagline",
      "normalization_helper": "be_schema_normalize_text"
    },
    "image_behavior": {
      "og_fallback_order": [
        "featured_image",
        "facebook_default_image",
        "global_default_image"
      ],
      "twitter_fallback_order": [
        "featured_image",
        "twitter_default_image",
        "global_default_image"
      ]
    },
    "og": {
      "type_rules": {
        "post": "article",
        "default": "website"
      },
      "fields": [
        "og:title",
        "og:description",
        "og:type",
        "og:url",
        "og:site_name",
        "og:image"
      ],
      "article_extras": [
        "article:published_time",
        "article:modified_time",
        "article:author"
      ],
      "optional_fields": [
        "fb:app_id"
      ]
    },
    "twitter": {
      "card_types": [
        "summary",
        "summary_large_image"
      ],
      "fields": [
        "twitter:card",
        "twitter:title",
        "twitter:description",
        "twitter:image"
      ],
      "handles": {
        "twitter_site": "site_handle_with_at",
        "twitter_creator": "creator_handle_with_at"
      }
    },
    "debug": {
      "log_prefix": "BE_SOCIAL_DEBUG",
      "snapshot_contents": [
        "url",
        "title",
        "description",
        "site_name",
        "og_enabled",
        "twitter_enabled",
        "og_type",
        "twitter_card_type",
        "resolved_images",
        "handles"
      ]
    }
  },
  "ui_notes": [
    "Schema > Website > Global: removed the panel title heading; section titles remain and now use a medium grey (#e1e4e8) background with dark text instead of black; global section padding increased to 15px; image row checkboxes centered with their fields; form-table left column now no-wraps and shrinks to fit content; Site Identity Mode uses a flex row with an ~380px checkbox column, 8px gap to the radios, and JS that bolds only the selected radio label.",
    "Schema > Website > Person: removed the panel title heading; honorific prefix and suffix are on one row with inline labels; panel now matches Global styling with bordered sections (Person Details, Person Links) using grey section headers and enclosed backgrounds.",
    "Schema > Website > Organisation/Publisher: removed panel titles; each now uses Global-style bordered sections with grey section headers enclosing enable toggles and their fields. Organisation optional fields (Legal Name, Organisation URL) now use a dropdown + add/remove pattern like Person.",
    "Schema > Snapshots tab (Health/Individual/WordPress panels) now uses Global-style bordered sections with grey section headers wrapping the read-only tables.",
    "Social Media dashboard and Facebook/Twitter subtabs now use Global-style bordered sections with grey section headers around their settings/overview/status/content/tools blocks. Facebook/Twitter Content panels now expose optional fields via dropdown + add/remove (Page URL/default image/App ID/notes; handle/default image/notes).",
    "Platforms submenu now includes placeholder tabs for Instagram, TikTok, and LinkedIn.",
    "Added a placeholder Platforms submenu between Open Graph and Tools for future network-specific controls.",
    "Facebook/Twitter/Instagram/TikTok/LinkedIn tabs now live under Platforms; Open Graph keeps the dashboard only."
  ],
  "validation_notes": [
    "Schema settings: added URL validation (http/https) for Organisation URL, publisher URLs/policies, and numeric copyright year (4 digits), surfacing errors via settings_errors.",
    "Social settings: added URL validation (http/https) for Global/Facebook/Twitter images and Facebook Page URL, with admin error notices."
  ],
  "ux_notes": [
    "Schema Website entities (Person/Organisation/Publisher) now show inline status pills (ON/OFF) within their sections to surface current enable state.",
    "Schema Settings debug row now includes a read-only debug readiness box showing WP_DEBUG, admin debug toggle, and BE_SCHEMA_DEBUG constant state.",
    "Schema Snapshots > Health: added Issues column with badges for missing org/publisher name/logo and quick links to the relevant Website subtabs.",
    "Schema > Website > Publisher now mirrors the Person optional-properties picker: Entity and Dedicated sections use a dropdown + add/remove buttons to reveal only the publisher fields you want to output.",
    "Publisher Dedicated optional controls (dropdown, add/remove, inputs) are only enabled when both WebSite.publisher and Dedicated Publisher toggles are on.",
    "Publisher panel now shows a secondary pill indicating publisher type: Reference (green) when enabled without dedicated, Dedicated (green) when dedicated is on, and None (red) when WebSite.publisher is disabled.",
    "Schema > Website > Person optional dropdown now includes Person URL, Alumni Of, Job Title, and Affiliation fields (add/remove on demand); values feed the Person node.",
    "Optional-property dropdowns gray out single-instance fields after they are added (e.g., Person URL, Org Legal Name/URL, publisher policies, Facebook page/app ID, Twitter handle, WebSite featured images).",
    "WebSite Featured Images show inline status pills: Undefined (grey) initially/after clear, Verified (green) when selected dimensions match recommendations, Resolution (red) when dimensions differ (16:9 = 1920x1080, 4:3 = 1600x1200, 1:1 = 1200x1200, 3:4 = 1200x1600, 9:16 = 1080x1920).",
    "WebSite Featured Images remove buttons now sit inline to the left of their labels (no overlap with the text).",
    "Site Logo now shows a guidance note to use a 512x512 transparent PNG and a status pill (Undefined/512 PNG green/red) that validates size and type on selection.",
    "Person optional fields that can be multi-valued (honorific prefixes/suffixes, alumni, job titles, affiliations) now support repeatable inputs via the dropdown + add behavior; Person URL remains singleton.",
    "Optional dropdown add logic now resets repeatable fields when first shown so selecting a multi-value property surfaces one input instead of duplicating blanks.",
    "Multi-value optional fields now normalize empty repeatables after adding from the dropdown to prevent duplicate blank rows, including when shown automatically.",
    "When a repeatable optional field is added from the dropdown for the first time, it now force-resets to a single blank row to avoid double inputs.",
    "Schema > Website > Person now uses a dedicated Image(s) section (outside Person Details) for the 1200x1200 WebP profile image with its enable toggle and status pill; Profile Image was removed from the optional dropdown.",
    "Removed the left-side border on the Person Image(s) section so it aligns with other Person panels.",
    "Schema > Website > Publisher > Dedicated now separates Custom Publisher Logo into its own Image(s) dropdown at the same level as other rows; the primary Optional Properties dropdown is limited to name and URL, and the image dropdown now offers all WebSite Featured Image aspect options.",
    "Schema > Website > Person > Image(s) now uses a dropdown to add any of the WebSite Featured Image aspect options (16:9, 4:3, 1:1, 3:4, 9:16) with enable toggles, previews, and dimension guidance.",
    "Schema > Website > Global > Site Logo now uses a dropdown to add WebSite Featured Image aspect options (16:9, 4:3, 1:1, 3:4, 9:16) with enable toggles, previews, and recommended dimensions; the selected logo feeds Organisation and WebSite.",
    "Renamed the admin submenu from Social Media to Open Graph and adjusted copy to say Open Graph.",
    "Open Graph global fallback image helper text now includes recommended specs: 1.91:1 aspect ratio, 1200x630 resolution, JPEG or PNG formats, plus an Alternate Aspect Ratios dropdown with common sizes and add/remove controls with left-aligned minus buttons.",
    "Platforms > Facebook > Content no longer shows a Default Facebook OG Image picker or Additional Aspect Ratios; only optional properties remain.",
    "Open Graph > Twitter > Content now uses a dedicated Default Twitter Card Image field (removed from the optional dropdown).",
    "Platforms > Facebook > Content no longer provides an Additional Aspect Ratios dropdown; only the dedicated Default Facebook OG Image field remains.",
    "Open Graph > Twitter > Content now offers an Additional Aspect Ratios dropdown that mirrors the Global/Facebook patterns (plus to add, left-aligned minus to remove, inline labels, Select/Clear controls, and previews for each aspect).",
    "Default Facebook OG Image help now includes specs: 1.91:1 aspect ratio, 1200x630 resolution, JPEG or PNG formats.",
    "Open Graph Content now surfaces the square 1:1 (1200x1200) image as its own field instead of an optional dropdown entry, and the dropdown now lists 1.91:1 and 1:1 as disabled items for clarity.",
    "Open Graph now has a Content tab that owns the Global Defaults block; Platforms dashboard shows a note pointing back to Open Graph for those settings.",
    "Platforms > Twitter > Content now includes an Alternate Twitter Card Image field alongside the primary default image.",
    "Platforms > Twitter > Content now splits into Content and Images sections; the Images box holds the default and alternate Twitter card images plus aspect-ratio variants.",
    "Platforms > Twitter > Content renamed default/alternate image labels to Summary Large and Summary, and removed Additional Aspect Ratios from that tab.",
    "Added placeholder Content and Images sections to Platforms > Instagram, TikTok, and LinkedIn tabs.",
    "Save Social Settings button moved to sit directly beneath the Image Selection Summary on the Social dashboard.",
    "Platforms > Twitter > Overview now contains the status pill; the separate Status subtab was removed.",
    "Platforms > Twitter > Status now appears as its own section directly below Overview (no longer nested).",
    "Platforms > Facebook > Overview now contains the status pill; the separate Status subtab was removed.",
    "Platforms > Facebook > Status now sits as its own section directly under Overview (no longer nested).",
    "Platforms > Twitter > Tools now includes a Twitter-only dry-run toggle that skips outputting Twitter meta tags while computing values.",
    "Platforms > Twitter > Tools now shows the Twitter dry-run toggle as its own section beneath Tools (not nested).",
    "Dashboard Safety dry run now affects only Open Graph output; Twitter has its own dry-run toggle under Tools.",
    "Platforms > Facebook > Tools now hosts the OpenGraph-only dry-run toggle (removed from the Platforms dashboard safety box).",
    "Platforms > Twitter > Tools now shows Dry Run as a standalone section beneath Tools (not nested).",
    "Social Dashboard no longer shows the OpenGraph dry-run safety box (moved to Platforms > Facebook > Tools).",
    "Image Selection Summary panels have been removed from Platforms (dashboard and overviews) to streamline the social UI."
  ],
  "logic_notes": [
    "Social engine now honors the per-network enable toggles: Open Graph output depends on social_enable_og, Twitter Cards on social_enable_twitter, and both keys now have defaults to avoid notices on fresh installs.",
    "The master social enable flag now mirrors the per-network toggles so Open Graph/Twitter output no longer stops early when the legacy master flag was unset."
  ],
  "refactor_notes": [
    "Centralized social settings defaults/merging into includes/engine/core-social-settings.php; core-social.php and the admin save now share a single source of truth for default keys and merges.",
    "Added a shared optional-field helper script (includes/admin/js/be-optional-fields.js) and wired Social admin dropdowns (Facebook/Twitter and image variants) to it to remove duplicated JS.",
    "Introduced a shared image validation toggle (default on) and began moving image status checks behind a reusable helper; Schema settings now expose an Image Validation Pills toggle.",
    "Schema optional dropdowns now use the shared optional-field helper with proper scopes/hidden/singleton metadata across Person, WebSite images, Organisation, and Publisher panels."
  ],
  "ui_notes_tools": [
    "Tools submenu now has Dashboard and Images tabs; Dashboard points to key schema/social toggles, Images links to Schema → WebSite images while we stage future utilities. Tabs now use WP nav-tab styling with inline CSS/JS fallback to ensure visibility."
  ],
  "text_tone_notes": [
    "Removed the leading \"Optional.\" prefix from optional-field helper text across Schema UI for cleaner phrasing.",
    "Person profile image helper now notes 1200x1200 WebP guidance and shows an inline status pill (Undefined Image / 1200x1200 WebP green/red based on size+type).",
    "Social Media > Facebook Content now splits Optional Properties (page URL, app ID, notes) and Optional Images (default OG image) into separate dropdowns/sections."
  ],
  "ux_notes_identity": [
    "Site Identity publisher option is only available when WebSite.publisher is enabled on the Publisher tab (dedicated publisher optional); identity radio/tab automatically disable when publisher is off. Publisher tab itself remains accessible so you can turn it on."
  ],
  "testing_notes": [
    "Manual test checklist in tests/README.md covering schema/social URL validation, copyright-year check, dry-run behaviour, and debug readiness pills. No automated test suite wired up yet."
  ],
  "safety_notes": [
    "Schema: added dry-run toggle (admin Settings) that prevents JSON-LD output while logging BE_SCHEMA_DRY_RUN events.",
    "Social: added dry-run toggle (Social Dashboard) that prevents OG/Twitter meta output while logging BE_SOCIAL_DRY_RUN events."
  ],
  "ux_notes_settings": [
    "Schema > Dashboard tab now uses Global-style bordered sections with grey headers (Engine, Debug & Safety) and a divider between debug and dry-run controls."
  ],
  "debug_notes": [
    "Schema Snapshots tab surfaces the last BE_SCHEMA_DEBUG_GRAPH payload (stored for 24h) with timestamp.",
    "Social Dashboard surfaces the last BE_SOCIAL_DEBUG snapshot (stored for 24h) with timestamp."
  ],
  "dev_workflow_notes": [
    "Home hero panel lists dev workflow reminders: pre-commit auto bump + auto message, use dry-run toggles for testing, check tests/README.md, keep beseo-devnotes.json updated.",
    "Changelog entries now include a generated Summary, a Description (neutral unless BESEO_CHANGELOG_DESC is set), and a Details list (from staged files or BESEO_COMMIT_MSG).",
    "Prepare-commit-msg hook now appends the first few staged files to the autogenerated title (unless BESEO_COMMIT_MSG is set) to keep commit subjects more descriptive.",
    "Fixed stray PHP endif in the social platforms layout after moving Global Defaults into the Open Graph Content tab."
  ]
}